
const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "💫",

    desc: "Get bot command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let TerraMenu = `╭━〔 *𝕸𝖀𝕷𝕷𝕰𝕽 𝕸𝕯 𝖃1* 〕━┈⊷
┃╭──────────────────
‎┃│🍹 *_𝐔𝐬𝐞𝐫 :_* ${pushname}
‎┃│🦄 *_𝐌𝐨𝐝𝐞 :_* ${config.MODE}
‎┃│🦋 *_𝐏𝐫𝐞𝐟𝐢𝐱 :_* ${config.PREFIX}
┃│💫 *_𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :_* \`𝕸𝖀𝕷𝕷𝕰𝕽\`
‎┃│⭐️ *_𝐕𝐞𝐫𝐬𝐢𝐨𝐧 :_* \`1.0.0\`
┃│🤖 *_𝐁𝐨𝐭-𝐍𝐚𝐦𝐞 :_* ${config.BOT_NAME}
┃│〽️ *_𝐀𝐥𝐰𝐚𝐲𝐬 𝐎𝐧𝐥𝐢𝐧𝐞 :_* 𝐀𝐜𝐭𝐢𝐯𝐞
‎┃╰──────────────────
╰━━━━━━━━━━━━━━━━━━━

     *\`ᴅᴏᴡɴʟᴏᴀᴅ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ғʙ*
> ├➩ *.ɪɴꜱᴛᴀ*
> ├➩ *.ᴠɪᴅᴇᴏ*
> ├➩ *.ɢᴅʀɪᴠᴇ*
> ├➩ *.ᴛᴡɪᴛᴛᴇʀ*
> ├➩ *.ᴛᴛ*
> ├➩ *.ᴍᴇᴅɪᴀғɪʀᴇ*
> ├➩ *.ᴘʟᴀʏ*
> ├➩ *.sᴏɴɢ*
> ├➩ *.ᴠɪᴅᴇᴏ*
> ├➩ *.sᴘᴏᴛɪꜰʏ*
> ├➩ *.ᴠɪᴅᴇᴏ4*
> ├➩ *.ɪᴍɢ*
> ├➩ *.Lʏʀɪᴄs*
> ├➩ *.ᴀᴘᴋ*
> ├➩ *.ʙᴀɪsᴄᴏᴘᴇ*
> ├➩ *.ɢɪɴɪsɪsɪʟᴀ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

       *\`sᴇᴀʀᴄʜ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ʏᴛꜱ*
> ├➩ *.ʏᴛᴀ*
> ├➩ *.ᴍᴏᴠɪᴇɪɴғᴏ*
> ├➩ *.ᴍᴏᴠɪᴇ*
> ├➩ *.Gᴏᴏɢʟᴇ*
> ├➩ *.ᴡᴇᴀᴛʜᴇʀ*
> ├➩ *.sᴛɪᴄᴋsᴇᴀʀᴄʜ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

        *\`ɢᴀᴍᴇ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ɴᴜᴍʙᴇʀɢᴀᴍᴇ*
> ├➩ *.ʀᴏʟʟ*
> ├➩ *.ᴄᴏɪɴꜰʟɪᴘ*
> ├➩ *.pick*
> ├➩ *.ᴋᴏɴᴀᴍɪ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

         *\`ɴsғᴡ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ɴsғᴡᴍᴇɴᴜ*
> ├➩ *.ᴛᴇʀʀᴀɴᴜᴅᴇ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

         *\`ᴀɪ-ɢᴘᴛ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ɢᴘᴛ*
> ├➩ *.ᴀɪ*
> ├➩ *.ᴀɴᴀʟʏsᴇ*
> ├➩ *.ʟʟᴀᴍᴀ3*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

        *\`ᴏᴡɴᴇʀ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
> ├➩ *.sᴇᴛᴛɪɴɢs*
> ├➩ *.ᴏᴡɴᴇʀ*
> ├➩ *.ʀᴇᴘᴏ*
> ├➩ *.ꜱʏꜱᴛᴇᴍ*
> ├➩ *.ꜱᴛᴀᴛᴜꜱ*
> ├➩ *.Aʙᴏᴜᴛ*
> ├➩ *.ʙʟᴏᴄᴋ*
> ├➩ *.ᴇᴠᴀʟ*
> ├➩ *.ᴜɴʙʟᴏᴄᴋ*
> ├➩ *.sʜᴜᴛᴅᴏᴡɴ*
> ├➩ *.ᴄʟᴇᴀʀᴄʜᴀᴛs*
> ├➩ *.sᴇᴛᴘᴘ*
> ├➩ *.ʙʀᴏᴀᴅᴄᴀsᴛ*
> ├➩ *.ᴊɪᴅ*
> ├➩ *.ɢᴊɪᴅ*
> ├➩ *.ᴘᴀɪʀ*
> ├➩ *.sᴀᴠᴇ*
> ├➩ *.ᴄᴀʟᴄ*
> ├➩ *.ʀᴇꜱᴛᴀʀᴛ*
> ├➩ *.sᴇᴛsᴜᴅᴏ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

        *\`ɢʀᴏᴜᴘ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ʀᴇᴍᴏᴠᴇ*
> ├➩ *.ᴅᴇʟ*
> ├➩ *.ᴀᴅᴅ*
> ├➩ *.ᴋɪᴄᴋ*
> ├➩ *.ᴋɪᴄᴋᴀʟʟ*
> ├➩ *.sᴇᴛɢᴏᴏᴅʙʏᴇ*
> ├➩ *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
> ├➩ *.ᴘʀᴏᴍᴏᴛᴇ*
> ├➩ *.ᴅᴇᴍᴏᴛᴇ*
> ├➩ *.ᴛᴀɢᴀʟʟ*
> ├➩ *.ɢᴇᴛᴘɪᴄ*
> ├➩ *.ɪɴᴠɪᴛᴇ*
> ├➩ *.ʀᴇᴠᴏᴋᴇ*
> ├➩ *.ᴘᴏʟʟ*
> ├➩ *.ʀᴀɴᴅᴏᴍsʜɪᴘ*
> ├➩ *.ɴᴇᴡɢᴄ*
> ├➩ *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
> ├➩ *.ᴀʟʟʀᴇǫ*
> ├➩ *.ᴍᴜᴛᴇ*
> ├➩ *.ᴜɴᴍᴜᴛᴇ*
> ├➩ *.ʟᴏᴄᴋɢᴄ*
> ├➩ *.ᴜɴʟᴏᴄᴋɢᴄ*
> ├➩ *.ʟᴇᴀᴠᴇ*
> ├➩ *.ɢɴᴀᴍᴇ*
> ├➩ *.ɢᴅᴇsᴄ*
> ├➩ *.ᴊᴏɪɴ*
> ├➩ *.ʜɪᴅᴇᴛᴀɢ*
> ├➩ *.ɢɪɴғᴏ*
> ├➩ *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏɴ*
> ├➩ *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏғғ*
> ├➩ *.ᴇᴘʜᴇᴍᴇʀᴀʟ 7ᴅ 24ʜ 90ᴅ*
> ├➩ *.sᴇɴᴅᴅᴍ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

         *\`ɪɴғᴏ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ᴀʙᴏᴜᴛ*
> ├➩ *.Dᴇᴠ*
> ├➩ *.ᴀʟɪᴠᴇ*
> ├➩ *.ʀᴇǫᴜᴇsᴛ*
> ├➩ *.ʙᴏᴛɪɴꜰᴏ*
> ├➩ *.ꜱᴛᴀᴛᴜꜱ*
> ├➩ *.ᴘɪɴɢ*
> ├➩ *.ᴘɪɴɢ2*
> ├➩ *.ꜱʏꜱᴛᴇᴍ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

       *\`ʀᴇʟɪɢɪᴏɴ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ʙɪʙʟᴇ*
> ├➩ *.ʙɪʙʟᴇʟɪsᴛ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

         *\`ʙᴏᴛ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ᴠᴇʀsɪᴏɴ*
> ├➩ *.ᴘʀᴇᴍɪᴜᴍ*
> ├➩ *.ʀᴇᴘᴏ*
> ├➩ *.ᴍᴇɴᴜ*
> ├➩ *.ᴄʜᴇᴄᴋᴜᴘᴅᴀᴛᴇ*
> ├➩ *.ᴜᴘᴅᴀᴛᴇ*
> ├➩ *.ᴍᴏᴅᴇ*
> ├➩ *.ᴀᴜᴛᴏᴛʏᴘɪɴɢ*
> ├➩ *.ᴀʟᴡᴀʏsᴏɴʟɪɴᴇ*
> ├➩ *.ᴀᴜᴛᴏʀᴇᴄᴏʀᴅɪɴɢ*
> ├➩ *.ᴀᴜᴛᴏʀᴇᴀᴅsᴛᴀᴛᴜs*
> ├➩ *.ᴀɴᴛɪʙᴀᴅ*
> ├➩ *.ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ*
> ├➩ *.ᴀᴜᴛᴏʀᴇᴘʟʏ*
> ├➩ *.ᴀᴜᴛᴏʀᴇᴀᴄᴛ*
> ├➩ *.ᴀɴᴛɪʟɪɴᴋ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

        *\`ᴄᴏɴᴠᴇʀᴛ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.sᴛɪᴄᴋᴇʀ*
> ├➩ *.ᴛᴀᴋᴇ*
> ├➩ *.ᴛʀᴛ*
> ├➩ *.ᴛᴛs*
> ├➩ *.ꜰᴀɴᴄʏ*
> ├➩ *.ᴜʀʟ*
> ├➩ *.sᴇɴᴅɪᴍᴀɢᴇ*
> ├➩ *.Aɢᴇ*
> ├➩ *.Cᴏɴᴠᴇʀᴛ*
> ├➩ *.ᴛɪɴʏ*
> ├➩ *.ᴛɢs*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

         *\`ᴏᴛʜᴇʀ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ᴛʀᴛ*
> ├➩ *.ᴊᴏᴋᴇ*
> ├➩ *.ꜰᴀᴄᴛ*
> ├➩ *.ɢɪᴛʜᴜʙ*
> ├➩ *.ɢᴘᴀꜱꜱ*
> ├➩ *.ʜᴀᴄᴋ*
> ├➩ *.ǫᴜᴏᴛᴇ*
> ├➩ *.ǫʀ*
> ├➩ *.vv*
> ├➩ *.sᴘᴀᴍ*
> ├➩ *.ᴠᴄᴀʀᴅ*
> ├➩ *.ꜱʀᴇᴘᴏ*
> ├➩ *.sʏsᴛᴇᴍ*
> ├➩ *.ʀᴀɴᴋ*
> ├➩ *.Tɪᴍᴇᴢᴏɴᴇ*
> ├➩ *.ᴅᴇꜰɪɴᴇ*
> ├➩ *.Dᴀɪʟʏꜰᴀᴄᴛ*
> ├➩ *.Mɪɴᴜᴛᴏʀ*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

       *\`ᴡᴀʟʟᴘᴀᴘᴇʀ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ɪᴍɢ*
> ├➩ *.ʟᴏɢᴏ*
> ├➩ *.ss*
> ┕────────────────❍
> *2025 𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*

        *\`ʀᴀɴᴅᴏᴍ-ᴍᴇɴᴜ\`*
> ╭────────────────❍
> ├➩ *.ᴅᴏɢ*
> ├➩ *.ᴄᴀᴛ*
> ├➩ *.ᴅɪᴀʀʏ*
> ├➩ *.ᴀɴɪᴍᴇ*
> ├➩ *.ᴄᴏᴜᴘʟᴇᴘᴘ*
> ├➩ *.ꜰɪɴᴅɴᴀᴍᴇ*
> ├➩ *.ʟᴏʟɪ*
> ├➩ *.ᴡᴀɪꜰᴜ*
> ├➩ *.ᴄᴏsᴘʟᴀʏ*
> ├➩ *.ɴᴇᴋᴏ*
> ├➩ *.ʀᴀɴᴅᴏᴍᴀɴɪᴍᴇ*
> ├➩ *.Sᴇɴᴅɪᴍᴀɢᴇ*
> ├➩ *.ᴀɴɪᴍᴇɢɪʀʟ*
> ├➩ *.ᴀɴɪᴍᴇɢɪʀʟ1*
> ├➩ *.ᴀɴɪᴍᴇɢɪʀʟ2*
> ├➩ *.ᴀɴɪᴍᴇɢɪʀʟ3*
> ├➩ *.ᴀɴɪᴍᴇɢɪʀʟ4*
> ├➩ *.ᴀɴɪᴍᴇɢɪʀʟ5*
> ├➩ *.ᴘɪᴄᴋᴜᴘʟɪɴᴇ*
> ┕────────────────❍
> *©𝕻𝕺𝖂𝕰𝕽𝕰𝕯 𝕭𝖄 𝕸𝖀𝕷𝕷𝕰𝕽 𝕯𝕰𝖁*`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:TerraMenu,
                          contextInfo: {
    mentionedJid: [m.sender],
    forwardingScore: 999,
    isForwarded: true,
    forwardedNewsletterMessageInfo: {
      newsletterJid: '120363419333086422@newsletter',
      newsletterName: '𝕸𝖀𝕷𝕷𝕰𝕽 𝐒𝐔𝐏𝐏𝐎𝐑𝐓',
      serverMessageId: 999
    }
  }
}, { quoted: mek });
}catch(e){
console.log(e)
reply(`${e}`)
}
})
